       49 lexer-ptr usage pointer.
       49 llvm-module usage pointer.
       49 llvm-dibuilder usage pointer.
       49 main-func usage pointer.
       49 llvm-target-machine usage pointer.
       49 has-lookahead pic x value 'N'.
