       48 lexer-ptr usage pointer.
       48 llvm-module usage pointer.
       48 llvm-dibuilder usage pointer.
       48 main-func usage pointer.
       48 llvm-target-machine usage pointer.
       48 llvm-data-layout usage pointer.
       48 module-identifier.
          copy "cobl-string.cpy".
       48 switch-ptr usage pointer.
       48 has-lookahead pic x value 'N'.
