       49 lexer-eof pic x value 'N'.
          88 lexer-at-eof value 'Y'.
          88 lexer-not-at-eof value 'N'.
       49 lexer-has-lookahead pic x value 'N'.
          88 lexer-does-have-lookahead value 'Y'.
          88 lexer-does-not-have-lookahead value 'N'.
       49 lexer-lookahead pic x.
